[
  {
    "id": 243223,
    "name": "Roktosheba.com",
    "demoUrl": "https://blood-donation-eta-blue.vercel.app/",
    "about": "This application serves as a platform to connect blood donors and recipients efficiently. Users can register as donors or request blood based on their specific needs. The app includes features like donor and volunteer management, blood request forms, and notifications to keep users informed. It emphasizes accessibility and community support in life-saving scenarios.",
    "features": [
      "Donor Registration: Individuals can sign up to become blood donors, providing their blood type, location, and availability.",
      "Blood Request Submission: Users in need of blood can submit requests specifying their requirements, facilitating quick matches with potential donors.",
      "Donor Search: A search function allows users to find registered donors based on blood type, location, and availability.",
      "Donor Profiles: Detailed profiles for each donor, including name, blood type, availability status, and location, help recipients make informed decisions.",
      "Success Stories: Testimonials from donors and recipients highlight the impact of blood donation and encourage community participation.",
      "Donation Tips: Guidelines and advice are provided to educate users on best practices before and after donating blood.",
      "Contact Information: Accessible contact details ensure users can reach out for support or inquiries.",
      "Coverage Areas: Information on the regions served by the platform, emphasizing its reach and availability."
    ],
    "technologies": [
      "Next.js",
      "SSR",
      "Swiper.js",
      "TailwindCSS",
      "Email.js",
      "Redux RTK-query",
      "Next-ui",
      "MongoDB",
      "Node.js",
      "Express.js",
      "Mongoose",
      "JWT",
      "CI/CD",
      "Notification"
    ],
    "images": [],
    "category": "MERN",
    "fullPage": "https://i.postimg.cc/GhDn9KXs/screencapture-blood-donation-eta-blue-vercel-app-2025-01-09-12-04-31.png"
  },
  {
    "id": 2432423,
    "name": "AktarExpress",
    "demoUrl": "https://aktarexpress.com/",
    "about": "Aktar Express is an online platform designed to streamline courier and parcel delivery services. It offers efficient and reliable logistics solutions for individuals and businesses, including package tracking, fast delivery options, and seamless booking features. The platform focuses on providing a user-friendly experience for managing deliveries and ensuring customer satisfaction.",
    "features": [
      "No registration or login in here but after carted products, manually should entry buyer information in checkout page.",
      "Display products with categories, descriptions, images, and prices.",
      "Advanced search and filter options for better product discovery.",
      "Add, update, or remove items from the cart.",
      "Secure and streamlined checkout process with multiple payment options.",
      "View past orders and reorder functionality.",
      "Manage inventory, product listings, and stock.",
      "Handle customer inquiries and process refunds or returns.",
      "Support for various payment gateways in stripe.",
      "Fully optimized for mobile, tablet, and desktop users.",
      "SEO-friendly URLs and metadata for better visibility on search engines."
    ],
    "technologies": [
      "Next JS",
      "SSR",
      "Swiper.js",
      "TailwindCSS",
      "Next Ui",
      "Redux RTK-query",
      "Node.js",
      "Express.js",
      "Recharts",
      "Stripe",
      "Loadash",
      "MongoDB",
      "Mongoose",
      "JWT"
    ],
    "images": [],
    "category": "MERN",
    "fullPage": "https://i.postimg.cc/cC472F6k/screencapture-aktarexpress-2025-01-09-12-31-11.png"
  },
  {
    "id": 4534536,
    "name": "Editorial News 24",
    "demoUrl": "https://editorialnews24.com/",
    "about": "Editorial News 24 is an online news platform that provides up-to-date news and information on various topics, including politics, business, technology, entertainment, and sports. The website aims to deliver accurate and timely news to its readers, keeping them informed about current events and developments both locally and internationally.",
    "features": [
      "News Categories: Sections dedicated to different topics such as politics, business, technology, entertainment, sports, and more.",
      "Search Functionality: A search bar that allows users to find articles or news on specific topics.",
      "User Registration and Login: Options for users to create accounts, log in, and manage their preferences.",
      "Comment Sections: Areas where readers can engage in discussions by commenting on articles.",
      "Social Media Integration: Buttons or links to share articles on various social media platforms.",
      "Multimedia Content: Inclusion of images, videos, and interactive media to complement news stories.",
      "Newsletter Subscription: An option for users to subscribe to newsletters for regular updates.",
      "Responsive Design: A layout that adapts to different devices, ensuring accessibility on desktops, tablets, and smartphones.",
      "Advertisement Spaces: Designated areas for advertisements to generate revenue.",
      "Contact Information: A section providing details on how to contact the editorial team or submit feedback."
    ],
    "technologies": [
      "ReactJS",
      "Vite",
      "MUI",
      "Redux",
      "NGINX",
      "Google Analytics",
      "React Router Dom"
    ],
    "images": [],
    "category": "MERN",
    "fullPage": "https://i.postimg.cc/8zJTPNmC/screencapture-editorialnews24-2025-01-10-15-17-37.png"
  },
  {
    "id": 4534536,
    "name": "FNS24-News Portal",
    "demoUrl": "https://www.fns24.com/",
    "about": "FNS24 is an online news platform that provides up-to-date news and information on various topics, including politics, business, technology, entertainment, and sports. The website aims to deliver accurate and timely news to its readers, keeping them informed about current events and developments both locally and internationally.",
    "features": [
      "News Categories: Sections dedicated to different topics such as politics, business, technology, entertainment, sports, and more.",
      "Search Functionality: A search bar that allows users to find articles or news on specific topics.",
      "User Registration and Login: Options for users to create accounts, log in, and manage their preferences.",
      "Comment Sections: Areas where readers can engage in discussions by commenting on articles.",
      "Social Media Integration: Buttons or links to share articles on various social media platforms.",
      "Multimedia Content: Inclusion of images, videos, and interactive media to complement news stories.",
      "Newsletter Subscription: An option for users to subscribe to newsletters for regular updates.",
      "Responsive Design: A layout that adapts to different devices, ensuring accessibility on desktops, tablets, and smartphones.",
      "Advertisement Spaces: Designated areas for advertisements to generate revenue.",
      "Contact Information: A section providing details on how to contact the editorial team or submit feedback."
    ],
    "technologies": [
      "ReactJS",
      "Vite",
      "Bootstrap-5",
      "Redux",
      "NGINX",
      "Font-awesome",
      "Axios",
      "Sutoni MG for bangla font."
    ],
    "images": [],
    "category": "React",
    "fullPage": "https://i.postimg.cc/L4jQvhwg/screencapture-fns24-2025-01-10-15-40-24.png"
  },
  {
    "id": 4534536,
    "name": "Pondit",
    "demoUrl": "https://www.pondit.com/",
    "about": "Pondit is course selling for technology students. It is basically Edu-tech site. There have also include all the mentors who takes the course classes and guide the students.",
    "features": [
      "This is a Vue+Vite web application.",
      "It is an Edu-tech web application."
    ],
    "technologies": [
      "Vue",
      "JQuery",
      "Vuex",
      "Bootstrap",
      "Owl carousel",
      "Jquery Slider"
    ],
    "images": [""],
    "category": "React",
    "fullPage": "https://i.ibb.co/qDMjTmj/scrnli-9-23-2023-1-23-07-PM.png"
  },
  {
    "id": 4534536,
    "name": "ACS Doubts by Ronon",
    "demoUrl": "https://acsdoubts.com/",
    "about": "This website is designed for HSC candidate for their subject wise problem solving. The students can post their problems as a picture. Then the solver solve the problem and get a commission for the solution.",
    "features": [
      "This is a Vue+Vite web application.",
      "It is an Educational web application.",
      "There have 3 types of role access methods - Student, Solver and administrator.",
      "Student enroll a package at their need and then a student can access to post his/her problem through the channel to solve the problem.",
      "The solver waiting for the problem, the try to solve the problem. If a solver solve a problem his/her account add the commission.",
      "Whole operation managed by several administrators."
    ],
    "technologies": [
      "Vue",
      "TailwindCSS",
      "Vuex",
      "SSL Commerze payment",
      "OTP",
      "JWT",
      "SSR"
    ],
    "images": ["https://i.ibb.co/Vj8x8qN/scrnli-9-23-2023-4-02-33-PM.png"],
    "category": "React",
    "fullPage": "https://i.ibb.co/sgC4zwC/scrnli-9-23-2023-4-07-42-PM.png"
  },
  {
    "id": 331234,
    "name": "icircles.app",
    "demoUrl": "https://icircles.app/",
    "about": "This website is for Icircles IT blog site website. It is a kind of social media website like facebook.",
    "features": [
      "Dynamic account web card view.",
      "Provide secure storage via ivault",
      "Create own microsite.",
      "Professional lunge page and personal lounge page.",
      "Can find jobs from this apps.",
      "Can markup your community via this website."
    ],
    "technologies": [
      "React JS",
      "MUI",
      "Redux RTK-query",
      "Pusher",
      "JWT",
      "Ant-D"
    ],
    "images": ["https://i.ibb.co/Vj8x8qN/scrnli-9-23-2023-4-02-33-PM.png"],
    "category": "React",
    "fullPage": "https://i.ibb.co/jwh5rkk/icircles-app.png"
  }
]
